Repository: forkbb/transformer
Catalog: app/lang/*/admin_install.po
Languages: fr

source: Welcome
fr: Ce script vous aidera a migrer une base de données de forum tiers vers forkBB. Vous pouvez aussi combiner les forums.

source: Choose install language
fr: Choisir la langue d'installation

source: Install language
fr: Language

source: Choose install language info
fr: La langue utilisée pour ce script.

source: Select
fr: Selectioner

source: Install
fr: Installer ForkBB rev.%s

source: Database source setup
fr: <b>Source</b>

source: Database receiver setup
fr: <b>Recepteur</b>

source: Info 1
fr: Toutes les informations nécessaires pour créer une connection à la base de données.

source: Database type
fr: Type de base

source: Info 2
fr: Sélectionner une base de données. Sont supportées SQLite, MySQL and PostgreSQL.

source: Database server hostname
fr: Serveur hôte de la base

source: Info 3
fr: Vous devriez pouvoir obtenir ces informations de votre hébergeur, si <code>localhost</code> ne fonctionne pas.

source: Database name
fr: Nom de la base

source: Info 4
fr: Le nom de la base de données sur laquelle vous voulez installer ForkBB.

source: Database username
fr: Nom d'utilisateur de la base

source: Database password
fr: Mot de passe d'accès à la base

source: Info 5
fr: Vos noms d'utilisateur et mot de passe de la base de données (ignorer pour SQLite).

source: Table prefix
fr: Préfixe de la table

source: Info 6
fr: Le préfixe peut contenir les lettres a à z, n'importe quel nombres et la caractère tiret souligné. Il doit toutefois commencer par une lettre. La longueur maximale est de 40 caractères.

source: Administration setup
fr: <b>Installation de l'administration</b>

source: Info 7
fr: Créez le tout premier compte de votre forum.

source: Administrator username
fr: Nom d'utilisateur de l'administrateur

source: Info 8
fr: Le nom d'utilisateur doit commencer par une lettre. Peut contenir lettres, nombres, espaces, points , tirets et tirets soulignés.

source: Administrator passphrase
fr: Phrase de passe de l'administrateur

source: Info 9
fr: La phrase de passe doit contenir quelques mots. Longueur minimale 16 caractères. Sensible à la casse.

source: Administrator email
fr: Email de l'administrateur

source: Info 10
fr: Veuillez entrer une adresse mail vallide.

source: Board setup
fr: <b>Configuration du forum</b>

source: Info 11
fr: Réglages du forum. Vous pouvez changer cela plus tard.

source: Board title
fr: Titre du forum

source: Board description
fr: Description du forum (supporte HTML)

source: Base URL
fr: L'adresse URL de votre forum

source: Default language
fr: Langue par défaut

source: Default style
fr: Style par défaut

source: Start install
fr: Commencer l'installation

source: You are running error
fr: Vous utilisez %1$s version %2$s. ForkBB rev.%3$s nécessite au moins %1$s %4$s pour fonctionner correctement. Vous devez mettre à jour votre installation de %1$s avant de pouvoir continuer.

source: Alert folder %s
fr: Pour que ForkBB fonctionne correctement, le dossier <em>%s</em> doit pouvoir être accédé en écriture par PHP. Utiliser chmod pour régler les permissions appropriées.

source: No language packs
fr: Pas de packs de langue.

source: No styles
fr: Pas de styles.

source: No DB extensions
fr: Cet environement PHP n’a aucune extension de connexion à la base de données que ForkBB supporte. PDO doit être activé.

source: No access to main.dist.php
fr: Pas d'accès à main.dist.php.

source: My ForkBB Forum
fr: Mon Forum ForkBB

source: Description
fr: Forum propulsé par un logiciel à code source libre - ForkBB.

source: Wrong email
fr: L'adresse mail administrateur entrée est invalide.

source: Table prefix error
fr: Le préfixe de table '%s' ne respecte pas le format.

source: Prefix reserved
fr: Les préfixes 'sqlite_' et 'pg_' sont réservés. Merci de choisir un préfixe différent.

source: Existing table error
fr: La base '%2$s' contient des tables avec le préfixe '%1$s': <b>%3$s</b>.

source: Administrators
fr: Administrateurs

source: Administrator
fr: Administrateur

source: Moderators
fr: Modérateurs

source: Moderator
fr: Modérateur

source: Guests
fr: Invités

source: Guest
fr: Invité

source: Members
fr: Membres

source: New members
fr: Nouveau membres

source: New member
fr: Nouveau membre

source: Announcement
fr: Entrer votre annonce ici.

source: Rules
fr: Entrer les règles ici

source: Maintenance message
fr: The forums est fermé provisoirement pour maintenance. Veuillez ré-essayer dans quelques minutes.

source: Test post
fr: Sujet test

source: Test message
fr: Si vous lisez ceci, l'installation de ForkBB semble avoir fonctionné! Maintenant connectez vous et direction le panneau de controle d'administration pour configurer votre forum.

source: Test category
fr: Catégorie de test

source: Test forum
fr: Forum de test

source: This is just a test forum
fr: Ceci est juste un forum de test

source: Bad database charset
fr: La base de données doit être créée avec l’encodage de caractères <b>utf8mb4</b> (compare <b>utf8mb4_unicode_ci</b>).

source: Bad database encoding
fr: La base de données doit être crée avec l’encodage de caractères <b>%s</b>.

source: Bad database collate
fr: La base de données doit être crée avec cette collation <b>C</b> (LC_COLLATE).

source: Bad database ctype
fr: La base de données doit être crée avec la classification de caractères <b>C</b> (LC_CTYPE).

source: Cookie setup
fr: <b>Réglage du cookie</b>

source: Info 12
fr: Les cookies sont des fichiers dédiés au site, ils permettent de stocker des données dans le navigateur de l’utilisateur, ce qui est utilisé pour son authentification.

source: Cookie Domain
fr: Domaine du cookie

source: Cookie Domain info
fr: Si vous spécifiez un (sous)domaine, alors les cookies déployés par le forum seront disponibles pour lui et <b>tous les sous-domaines </b>! www.example.com et example.com <b>ne sont pas le même domaine</b>. www.example.com est un sous-domaine de example.com. <b>Laisser ce champ vide</b> si le cookie est uniquement pour le domaine du forum.

source: Cookie Path
fr: Chemin du cookie

source: Cookie Path info
fr: Le chemin sur le serveur sur lequel le cookie sera disponible. Si mis à <b>/</b>, le cookie sera disponible sur le domaine entier. Si mis à <b>/foo/</b>, le cookie sera uniquement disponible dans le dossier <b>/foo/</b> et tous ses sous-dossiers, comme <b>/foo/bar/</b>.

source: Yes
fr: Oui

source: No
fr: Non

source: Cookie Secure info
fr: Indique que le cookie devrait être transmis uniquement sur une connexion sécurisée <b>HTTPS</b> avec le client. Si <b>YES</b>, le cookie sera uniquement crée si une connexion sécurisée existe.

source: Script runs error
fr: Il semble que le script a déjà été lancé. Si c'est par vous, vous pouvez effacer le cache si vous ne souhaitez pas attendre la fin du TTL.

source: Script key error
fr: Il semble que quelqu'un à vider le cache pendant que le script s'executait.

source: Database belongs to unknown forum type
fr: La base de données appartient à un forum de type inconnu.

source: %s does not have required tables
fr: Le pilote '%s' n'a pas accès aux tables requises.

source: Current version '%1$s' is %2$s, need %3$s to %4$s
fr: La version actuelle de la base de données '%1$s' est %2$s, nécessite %3$s à %4$s.

source: This database is empty
fr: La base de données est vide, ou le préfixe est incorrect.

source: Step %1$s %3$s (%2$s)
fr: Etape %1$s '%3$s' (%2$s).

source: For SQLite, the database file...
fr: Pour SQLite, les fichiers de base de données doivent se situer dans le répertoire <b>/app/config/db/</b> .

source: Source legend
fr: Source

source: Receiver legend
fr: Récepteur

source: Board type
fr: Type de forum

source: Working mode
fr: Mode de fonctionnement

source: Start copy
fr: Commencer la copie

source: Start merge
fr: Commencer l'assemblage

source: Backup
fr: Assurez vous d'avoir une sauvegarde.

source: Rows
fr: Rangées

source: Size
fr: Taille

source: Invalid DB status flag
fr: Drapeau de statut de la base invalide.

source: Database ready
fr: La base de données est prête.

source: Config file is generated
fr: Le fichier de configuration <b>main.php</b> est généré dans le répertoire <b>/app/config/</b>.

source: Instruction
fr: Après avoir démarré ForkBB avec une nouvelle basee de donnéees, en premier lieu, vérifiez attentivement les réglages du panneau administrateur. Reconstruire aussi l'index de recherche.
